In [250]:
import json
import pandas as pd
import datetime
from geopy.geocoders import Nominatim
from math import radians, cos, sin, asin, sqrt
from geopy.geocoders import GoogleV3
from googlemaps import googlemaps
gmaps = googlemaps.Client(key='AIzaSyBogDcm431wj6Vqv5H3usD7SLm-REr4kck')

#### Reading Kaggle rental dataset

In [133]:
with open('/Users/ClumsyJace/Final Thesis Folder/train.json', 'r') as f:
    data = json.load(f)
rental = pd.DataFrame(data)
print("There are", len(rental), "records")
print(" ")
rental.head(3)

There are 49352 records

,bathrooms,bedrooms,building_id,created,description,display_address,features,interest_level,latitude,listing_id,longitude,manager_id,photos,price,street_address
10,1.5,3,53a5b119ba8f7b61d4e010512e0dfc85,2016-06-24 07:54:24,A Brand New 3 Bedroom 1.5 bath ApartmentEnjoy ...,Metropolitan Avenue,[],medium,40.7145,7211212,-73.9425,5ba989232d0489da1b5f2c45f6688adc,[https://photos.renthop.com/2/7211212_1ed4542e...,3000,792 Metropolitan Avenue
10000,1.0,2,c5c8a357cba207596b04d1afd1e4f130,2016-06-12 12:19:27,,Columbus Avenue,"[Doorman, Elevator, Fitness Center, Cats Allow...",low,40.7947,7150865,-73.9667,7533621a882f71e25173b27e3139d83d,[https://photos.renthop.com/2/7150865_be3306c5...,5465,808 Columbus Avenue
100004,1.0,1,c3ba40552e2120b0acfc3cb5730bb2aa,2016-04-17 03:26:41,"Top Top West Village location, beautiful Pre-w...",W 13 Street,"[Laundry In Building, Dishwasher, Hardwood Flo...",high,40.7388,6887163,-74.0018,d9039c43983f6e564b1482b273bd7b01,[https://photos.renthop.com/2/6887163_de85c427...,2850,241 W 13 Street

#### Reading NYC census demographic

In [116]:
data1 = pd.ExcelFile("/Users/ClumsyJace/Final Thesis Folder/NYC_Demographic.xlsx")
demo = data1.parse("nycdemo")
print("There are", len(demo), "records")
print(" ")
demo.head(3)

There are 1794 records

,Zip,State,County,City,Median Household Income,Number of Income Household,Number Population by Race,Number of Family Households in Poverty,Number of individual unemployed
0,6390,New York,Suffolk,Southold,151083,134,339,94,214
1,10001,New York,New York,New York,86801,11639,23537,3668,14785
2,10002,New York,New York,New York,33726,33348,80736,17572,39320

#### Reading NYC starbucks locations

In [117]:
data2 = pd.ExcelFile("/Users/ClumsyJace/Final Thesis Folder/NYC_Starbucks_locations.xlsx")
starloc = data2.parse("starloc")
print("There are", len(starloc), "records")
print(" ")
starloc.head()

There are 45 records

   Longitude  Latitude
0     -74.00     40.75
1     -74.00     40.76
2     -73.99     40.75
3     -73.99     40.74
4     -73.98     40.73

#### Reading NYC starbucks stores info

In [118]:
data3 = pd.ExcelFile("/Users/ClumsyJace/Final Thesis Folder/NYC_Starbucks.xlsx")
#data2.sheet_names # print sheetnames
starstores = data3.parse("nycstar")
print("There are", len(starstores), "stores in NYC")
print(" ")
starstores.head()

There are 205 stores in NYC

       Brand      City State/Province Country   Postcode  Longitude  Latitude
0  Starbucks  New York             NY      US      10075     -73.95     40.77
1  Starbucks  New York             NY      US  100382504     -74.01     40.71
2  Starbucks  New York             NY      US  100197416     -73.99     40.76
3  Starbucks  New York             NY      US  100131218     -74.01     40.73
4  Starbucks  New York             NY      US  100256924     -73.97     40.79

### SECTION # 3 - FEATURE ENGINEERING

#### <b>A) Cleaning rental dataset</b>

In [134]:
#priting out the columns name 
rentalcol = list(rental)
for x in rentalcol:
    print(x,end=', ')

bathrooms, bedrooms, building_id, created, description, display_address, features, interest_level, latitude, listing_id, longitude, manager_id, photos, price, street_address,

In [135]:
rental.head(2)

,bathrooms,bedrooms,building_id,created,description,display_address,features,interest_level,latitude,listing_id,longitude,manager_id,photos,price,street_address
10,1.5,3,53a5b119ba8f7b61d4e010512e0dfc85,2016-06-24 07:54:24,A Brand New 3 Bedroom 1.5 bath ApartmentEnjoy ...,Metropolitan Avenue,[],medium,40.7145,7211212,-73.9425,5ba989232d0489da1b5f2c45f6688adc,[https://photos.renthop.com/2/7211212_1ed4542e...,3000,792 Metropolitan Avenue
10000,1.0,2,c5c8a357cba207596b04d1afd1e4f130,2016-06-12 12:19:27,,Columbus Avenue,"[Doorman, Elevator, Fitness Center, Cats Allow...",low,40.7947,7150865,-73.9667,7533621a882f71e25173b27e3139d83d,[https://photos.renthop.com/2/7150865_be3306c5...,5465,808 Columbus Avenue

In [136]:
#Checking for Dups
listingcount = rental.groupby('listing_id')['listing_id'].size()
len(listingcount[listingcount > 1])

0

In [137]:
#Droping not relevant columns
rental = rental.drop(['building_id', 'description', 'display_address', 'features','street_address','photos','created','listing_id','manager_id']
                     ,axis=1)

In [138]:
#checking for missing values
rental.info()

<class 'pandas.core.frame.DataFrame'>
Index: 49352 entries, 10 to 99994
Data columns (total 6 columns):
bathrooms         49352 non-null float64
bedrooms          49352 non-null int64
interest_level    49352 non-null object
latitude          49352 non-null float64
longitude         49352 non-null float64
price             49352 non-null int64
dtypes: float64(3), int64(2), object(1)
memory usage: 2.6+ MB

In [157]:
rental['address'] = "" #create a new column"

In [143]:
rental.head()

        bathrooms  bedrooms interest_level  latitude  longitude  price address
10            1.5         3         medium   40.7145   -73.9425   3000
10000         1.0         2            low   40.7947   -73.9667   5465
100004        1.0         1           high   40.7388   -74.0018   2850
100007        1.0         1            low   40.7539   -73.9677   3275
100013        1.0         4            low   40.8241   -73.9493   3350

#### <b>B) Using Geocode to impute new field such as zipcode</b>

In [261]:
rental.head()

,bathrooms,bedrooms,interest_level,latitude,longitude,price,address,coordinates
10,1.5,3.0,medium,40.7145,-73.9425,3000.0,,"(40.7145, -73.9425)"
10000,1.0,2.0,low,40.7947,-73.9667,5465.0,,"(40.7947, -73.9667)"
100004,1.0,1.0,high,40.7388,-74.0018,2850.0,,"(40.7388, -74.0018)"
100007,1.0,1.0,low,40.7539,-73.9677,3275.0,,"(40.7539, -73.9677)"
100013,1.0,4.0,low,40.8241,-73.9493,3350.0,,"(40.8241, -73.9493)"

In [259]:
def coordinates(x,y):
    return (x,y)

In [260]:
rental['coordinates'] = rental.apply(lambda row: coordinates(row['latitude'], row['longitude']), axis=1)

In [262]:
def makelist(x):
    corlist = []
    for i in x:
        corlist.append(i)
    return corlist

In [272]:
corlist = makelist(rental['coordinates'])

In [273]:
from geocodio import GeocodioClient
client = GeocodioClient('5d2d2ddcae50a2bd2dc75990e27e0d96ca27292')

In [301]:
corlist1 = corlist[:10000]
corlist2 = corlist[10001:20001]
corlist3 = corlist[20001:30001]
corlist4 = corlist[30001:40001]
corlist5 = corlist[40001:]

In [302]:
a = len(corlist1) + len(corlist2) + len(corlist3) + len(corlist4) + len(corlist5)
a

49352

In [303]:
address_sets1 = client.reverse(corlist1)
address_sets2 = client.reverse(corlist2)
address_sets3 = client.reverse(corlist3)
address_sets4 = client.reverse(corlist4)
address_sets5 = client.reverse(corlist5)

In [305]:
list_address1 = address_sets1.formatted_addresses
list_address2 = address_sets2.formatted_addresses
list_address3 = address_sets3.formatted_addresses
list_address4 = address_sets4.formatted_addresses
list_address5 = address_sets5.formatted_addresses

In [306]:
mergelist = list_address1 + list_address2 + list_address3 + list_address4 + list_address5

In [320]:
len(mergelist)

49352

In [332]:
mergedlistdf = pd.DataFrame(mergelist)
mergedlistdf.columns = ['address']
mergedlistdf.head()

                                address
0   370 Humboldt St, Brooklyn, NY 11211
1  808 Columbus Ave, New York, NY 10025
2     239 W 13th St, New York, NY 10011
3     333 E 49th St, New York, NY 10022
4    500 W 143rd St, New York, NY 10031

In [339]:
rental.insert(0, 'ID', range(1, 1 + len(rental)))
mergedlistdf.insert(0, 'ID', range(1, 1 + len(mergedlistdf)))

In [350]:
finaldata = pd.merge(rental, mergedlistdf, on='ID', how='inner')

In [342]:
finaldata.head()

,ID,bathrooms,bedrooms,interest_level,latitude,longitude,price,address_x,coordinates,address_y
0,1,1.5,3.0,medium,40.7145,-73.9425,3000.0,,"(40.7145, -73.9425)","370 Humboldt St, Brooklyn, NY 11211"
1,2,1.0,2.0,low,40.7947,-73.9667,5465.0,,"(40.7947, -73.9667)","808 Columbus Ave, New York, NY 10025"
2,3,1.0,1.0,high,40.7388,-74.0018,2850.0,,"(40.7388, -74.0018)","239 W 13th St, New York, NY 10011"
3,4,1.0,1.0,low,40.7539,-73.9677,3275.0,,"(40.7539, -73.9677)","333 E 49th St, New York, NY 10022"
4,5,1.0,4.0,low,40.8241,-73.9493,3350.0,,"(40.8241, -73.9493)","500 W 143rd St, New York, NY 10031"

In [346]:
finaldata.to_csv('finaldataforthesiswithaddress.csv', sep='\t')

In [351]:
finaldata = finaldata.drop(['ID', 'address_x'] ,axis=1)

In [352]:
finaldata.head()

,bathrooms,bedrooms,interest_level,latitude,longitude,price,coordinates,address_y
0,1.5,3.0,medium,40.7145,-73.9425,3000.0,"(40.7145, -73.9425)","370 Humboldt St, Brooklyn, NY 11211"
1,1.0,2.0,low,40.7947,-73.9667,5465.0,"(40.7947, -73.9667)","808 Columbus Ave, New York, NY 10025"
2,1.0,1.0,high,40.7388,-74.0018,2850.0,"(40.7388, -74.0018)","239 W 13th St, New York, NY 10011"
3,1.0,1.0,low,40.7539,-73.9677,3275.0,"(40.7539, -73.9677)","333 E 49th St, New York, NY 10022"
4,1.0,4.0,low,40.8241,-73.9493,3350.0,"(40.8241, -73.9493)","500 W 143rd St, New York, NY 10031"

In [353]:
finaldata.rename(columns={'address_y':'address'}, inplace=True)

In [356]:
finaldata.head()

,bathrooms,bedrooms,interest_level,latitude,longitude,price,coordinates,address,zipcode
0,1.5,3.0,medium,40.7145,-73.9425,3000.0,"(40.7145, -73.9425)","370 Humboldt St, Brooklyn, NY 11211",NaN
1,1.0,2.0,low,40.7947,-73.9667,5465.0,"(40.7947, -73.9667)","808 Columbus Ave, New York, NY 10025",NaN
2,1.0,1.0,high,40.7388,-74.0018,2850.0,"(40.7388, -74.0018)","239 W 13th St, New York, NY 10011",NaN
3,1.0,1.0,low,40.7539,-73.9677,3275.0,"(40.7539, -73.9677)","333 E 49th St, New York, NY 10022",NaN
4,1.0,4.0,low,40.8241,-73.9493,3350.0,"(40.8241, -73.9493)","500 W 143rd St, New York, NY 10031",NaN

In [372]:
def zipping(x):
    a = str(x)
    return a[-5:]

In [373]:
finaldata['zipcode'] = finaldata.apply(lambda row: zipping(row['address']), axis=1)

In [374]:
finaldata.head()

,bathrooms,bedrooms,interest_level,latitude,longitude,price,coordinates,address,zipcode
0,1.5,3.0,medium,40.7145,-73.9425,3000.0,"(40.7145, -73.9425)","370 Humboldt St, Brooklyn, NY 11211",11211
1,1.0,2.0,low,40.7947,-73.9667,5465.0,"(40.7947, -73.9667)","808 Columbus Ave, New York, NY 10025",10025
2,1.0,1.0,high,40.7388,-74.0018,2850.0,"(40.7388, -74.0018)","239 W 13th St, New York, NY 10011",10011
3,1.0,1.0,low,40.7539,-73.9677,3275.0,"(40.7539, -73.9677)","333 E 49th St, New York, NY 10022",10022
4,1.0,4.0,low,40.8241,-73.9493,3350.0,"(40.8241, -73.9493)","500 W 143rd St, New York, NY 10031",10031

In [375]:
finaldata.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 49352 entries, 0 to 49351
Data columns (total 9 columns):
bathrooms         49352 non-null float64
bedrooms          49352 non-null float64
interest_level    49352 non-null object
latitude          49352 non-null float64
longitude         49352 non-null float64
price             49352 non-null float64
coordinates       49352 non-null object
address           49352 non-null object
zipcode           49352 non-null object
dtypes: float64(5), object(4)
memory usage: 5.0+ MB

In [376]:
final_rental = finaldata

In [377]:
len(final_rental)

49352

#### <b>D) Creating final data set by merging demo and final_rental</b>

In [380]:
final_rental.rename(columns={'zipcode':'Zip'}, inplace=True)

In [379]:
demo.head()

,Zip,State,County,City,Median Household Income,Number of Income Household,Number Population by Race,Number of Family Households in Poverty,Number of individual unemployed
0,6390,New York,Suffolk,Southold,151083,134,339,94,214
1,10001,New York,New York,New York,86801,11639,23537,3668,14785
2,10002,New York,New York,New York,33726,33348,80736,17572,39320
3,10003,New York,New York,New York,98151,27487,57112,7331,36392
4,10004,New York,New York,New York,119691,1574,3221,591,2255

In [381]:
final_rental.head()

,bathrooms,bedrooms,interest_level,latitude,longitude,price,coordinates,address,Zip
0,1.5,3.0,medium,40.7145,-73.9425,3000.0,"(40.7145, -73.9425)","370 Humboldt St, Brooklyn, NY 11211",11211
1,1.0,2.0,low,40.7947,-73.9667,5465.0,"(40.7947, -73.9667)","808 Columbus Ave, New York, NY 10025",10025
2,1.0,1.0,high,40.7388,-74.0018,2850.0,"(40.7388, -74.0018)","239 W 13th St, New York, NY 10011",10011
3,1.0,1.0,low,40.7539,-73.9677,3275.0,"(40.7539, -73.9677)","333 E 49th St, New York, NY 10022",10022
4,1.0,4.0,low,40.8241,-73.9493,3350.0,"(40.8241, -73.9493)","500 W 143rd St, New York, NY 10031",10031

In [382]:
#Changing the type for successful merge
demo['Zip'] = demo['Zip'].astype(str)
final_rental['Zip'] = final_rental['Zip'].astype(str)

In [383]:

finaldata = pd.merge(final_rental, demo, on='Zip', how='left')
finaldata.head()

,bathrooms,bedrooms,interest_level,latitude,longitude,price,coordinates,address,Zip,State,County,City,Median Household Income,Number of Income Household,Number Population by Race,Number of Family Households in Poverty,Number of individual unemployed
0,1.5,3.0,medium,40.7145,-73.9425,3000.0,"(40.7145, -73.9425)","370 Humboldt St, Brooklyn, NY 11211",11211,New York,Kings,New York,54406.0,37381.0,97772.0,18948.0,52303.0
1,1.0,2.0,low,40.7947,-73.9667,5465.0,"(40.7947, -73.9667)","808 Columbus Ave, New York, NY 10025",10025,New York,New York,New York,74065.0,43456.0,96068.0,19089.0,54390.0
2,1.0,1.0,high,40.7388,-74.0018,2850.0,"(40.7388, -74.0018)","239 W 13th St, New York, NY 10011",10011,New York,New York,New York,109818.0,29762.0,52349.0,9004.0,36403.0
3,1.0,1.0,low,40.7539,-73.9677,3275.0,"(40.7539, -73.9677)","333 E 49th St, New York, NY 10022",10022,New York,New York,New York,126378.0,17892.0,30607.0,5998.0,19783.0
4,1.0,4.0,low,40.8241,-73.9493,3350.0,"(40.8241, -73.9493)","500 W 143rd St, New York, NY 10031",10031,New York,New York,New York,39774.0,21191.0,59244.0,10655.0,34229.0

In [384]:
len(finaldata)

49352

#### <b>E) Adding the distance columns from starbucks</b>

In [385]:
def haversine(lon1, lat1, lon2, lat2):
    """
    Calculate the great circle distance between two points 
    on the earth (specified in decimal degrees)
    """
    # convert decimal degrees to radians 
    lon1, lat1, lon2, lat2 = map(radians, [lon1, lat1, lon2, lat2])
    # haversine formula 
    dlon = lon2 - lon1 
    dlat = lat2 - lat1 
    a = sin(dlat/2)**2 + cos(lat1) * cos(lat2) * sin(dlon/2)**2
    c = 2 * asin(sqrt(a)) 
    # Radius of earth in kilometers is 6371
    miles = 3961* c
    return miles

In [386]:
def distance(df1,df2):
    df1['dist'] = [list() for x in range(len(df1.index))] # create empty list for each records 
    for i in range(len(df1)):
        for j in range(len(df2)):
            long1, lat1 = df1['longitude'][i], df1['latitude'][i]
            long2, lat2 = df2['Longitude'][j], df2['Latitude'][j]
            dist = round(haversine(long1, lat1, long2, lat2),2)
            df1['dist'][i].append(dist)
    return df1

# Starting there !!!

In [390]:
finaldatamerged = distance(finaldata,starloc)

In [391]:
finaldatamerged.to_csv('finaldataforthesis_withaddress_merged.csv', sep='\t')

In [392]:
finaldatamerged.head(3)

,bathrooms,bedrooms,interest_level,latitude,longitude,price,coordinates,address,Zip,State,County,City,Median Household Income,Number of Income Household,Number Population by Race,Number of Family Households in Poverty,Number of individual unemployed,dist
0,1.5,3.0,medium,40.7145,-73.9425,3000.0,"(40.7145, -73.9425)","370 Humboldt St, Brooklyn, NY 11211",11211,New York,Kings,New York,54406.0,37381.0,97772.0,18948.0,52303.0,"[3.89, 4.36, 3.49, 3.05, 2.24, 2.71, 3.68, 3.5..."
1,1.0,2.0,low,40.7947,-73.9667,5465.0,"(40.7947, -73.9667)","808 Columbus Ave, New York, NY 10025",10025,New York,New York,New York,74065.0,43456.0,96068.0,19089.0,54390.0,"[3.55, 2.97, 3.32, 3.97, 4.53, 4.64, 6.93, 6.2..."
2,1.0,1.0,high,40.7388,-74.0018,2850.0,"(40.7388, -74.0018)","239 W 13th St, New York, NY 10011",10011,New York,New York,New York,109818.0,29762.0,52349.0,9004.0,36403.0,"[0.78, 1.47, 0.99, 0.62, 1.29, 0.87, 2.72, 2.0..."

In [393]:
def minimum_distance(df):
    df['min_dist'] = ""
    for i in range(len(df)):
        mindist = min(df['dist'][i])
        df['min_dist'][i] = mindist
    return df

In [ ]:
finaldatamerged = minimum_distance(finaldatamerged)

/Users/ClumsyJace/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """

In [1]:
finaldatamerged.head()

NameError: name 'finaldata' is not defined